#最初の一度だけ表示するためにここに記述
p "=============================================="
p "         あっち向いてホイを開始します         "
p "=============================================="

#処理内容
#=============================================================================
def attimuitehoi
  @return_much = 0              #再戦時、再戦指示の値を消去
  
  p "まずはじゃんけん・・・"
  p ""
  p "0=>グー　  1=>チョキ　  2=>パー　  3=>戦わない"
  p 
  p "数字を選んだらEnterを押してください"
  p "=============================================="
  
  def janken
    @you_win = 0               #再戦時、じゃんけんに勝った記録を消去
    player_hand = gets.chomp.to_i
    cpu_hand = rand(0..2)
    
    case player_hand
      when 0,1,2
        current_hand = ["グー","チョキ","パー"]
        p "=============================================="
        p "  あなたの手は#{current_hand[player_hand]}です","       相手の手は#{current_hand[cpu_hand]}です"
        p "=============================================="
        if player_hand == cpu_hand
          p "=============================================="
          p "                 あいこで                     "
          p "=============================================="
          return true
          
        elsif (player_hand == 0 && cpu_hand == 1)||
          (player_hand == 1 && cpu_hand == 2)||
          (player_hand == 2 && cpu_hand == 0)
          p "=============================================="
          p "            あなたの勝ちです!                 "
          p "=============================================="
          @you_win = 1
          return false
          
        else 
          p "=============================================="
          p "            あなたの負けです…。               "
          p "=============================================="
          return false
        end
        
      when 3
        p "=============================================="
        p "              相手の不戦勝です                "
        p "              お疲れ様でした                  "
        p "=============================================="
        exit!
        
      else
        p "=============================================="
        p "               無効な数値です。               "
        p "0~3の数値を入れてください"
        p ""
        p "    0=>グー　1=>チョキ　2=>パー　3=>戦わない  "
        p ""
        p "数字を選んだらEnterを押してください"
        p "=============================================="
    end
  end
  
  
  def janken_kati
    p ""
    p ""
    p "=============================================="
    p "　　　続いてあっち向いてホイを開始します      "
    p "　　　　　どの方向に指を指しますか？　　　　　"
    p "=============================================="
    p "あっち向いて〜"
    p "　　   0=>上　　1=>下　　2=>右　　3=>左"
    p "=============================================="
    p "数字を選んだらEnterを押してください"
    p "=============================================="
    
      player_finger = gets.chomp.to_i
      cpu_face = rand(0..3)
      current_finger = ["上","下","右","左"]
      
      p "=============================================="
      p "  あなたは#{current_finger[player_finger]}を指しました","      cpuは#{current_finger[cpu_face]}を向きました"
      p "=============================================="
      
      if player_finger == cpu_face
        p "=============================================="
        p "              あなたの勝ちです！              "
        p "=============================================="
        
      elsif player_finger != cpu_face
        p "=============================================="
        p "              あなたの負けです…。             "
        p "　　　　なのでじゃんけんから仕切り直し！　　　"
        p "=============================================="
        @return_much = 1
      end
  end
  
  
  def janken_make
    p ""
    p ""
    p "=============================================="
    p "　　　続いてあっち向いてホイを開始します      "
    p "　　　顔をどっちに向けるか決めてください　　  "
    p "=============================================="
    p "あっち向いて〜"
    p "　   　0=>上　　1=>下　　2=>右　　3=>左"
    p "=============================================="
    p "数字を選んだらEnterを押してください"
    p "=============================================="
    
    player_face = gets.chomp.to_i
    cpu_finger = rand(0..3)
    current_face = ["上","下","右","左"]
    
    p "=============================================="
    p "  あなたは#{current_face[player_face]}を向きました","      cpuは#{current_face[cpu_finger]}を指しました"
    p "=============================================="
    
    if player_face != cpu_finger
      p "=============================================="
      p "            あなたの勝ちです！                "
      p "　　　　なのでじゃんけんから仕切り直し！　　　"
      p "=============================================="
      @return_much = 2
      
    elsif player_face == cpu_finger
      p "=============================================="
      p "            あなたの負けです…。               "
      p "=============================================="
    end
  end

  
#処理No.2 処理開始
#=========================================================================
  return_game = true
  while return_game
    return_game = janken       #じゃんけんがあいこだった場合再度じゃんけんを行う処理
  end
    
  if @you_win == 1
    janken_kati
  else
    janken_make
  end
  
  #勝負がつかなかった際にゲームを最初からやり直す処理
  case
  when @return_much == 1       #じゃんけんに勝ち、あっち向いてホイに負けた
    return true
  end
  
  case
  when @return_much == 2       #じゃんけんに負け、あっち向いてホイに勝った
    return true
  end
  
  
  #勝負がついた時、もう一度ゲームをプレイするかをプレイヤーに決めてもらう処理
  p "=============================================="
  p "            ゲームを続けますか？              "
  p "続ける　　=>　1とEnterを押してください"
  p "終了する　=>　2とEnterを押してください"
  p "=============================================="
  continue_which = gets.chomp.to_i
  
  case
  when continue_which == 1
    return true
  when continue_which == 2
    p "=============================================="
    p "             ゲームを終了します！             "
    p "               お疲れ様でした！               "
    p "=============================================="
    return false
  else
    p "=============================================="
    p "              無効な数値です。                "
    p "　　　　　　ゲームを終了します。　　　　　　　"
    p "=============================================="
    exit!
  end
end


#処理No.1 ゲーム開始の命令
#=========================================================================
game_start = true
while game_start
  game_start = attimuitehoi
end